## Описание проекта

Этот проект создается для помощи изучения английского. В некотором смысле функционал скопирован из других сайтов, но что тут поделать, в мире есть не только одна машина.

Проект минимально будет состоять из:
- Библиотека
- Карточки слов
- Изучение слов по карточкам
- Практика слов с написанием
- Практика предложении

### Библиотека

**Что такое Библиотека?**

**Библиотека** - это некая отдельная сущность в проекте, где будет включать себя "Карточки слов", "Практика слов с написанием"
и "Практика предложении". Иными словами, это сущность объединяющие эти пункты, некая группировка.

_Приведу пример:_

Мы можем создать **библиотеку** под названием "500 наиболее употреблямых слов. Существительные". После создания, мы зайдем в вкладку "Карточки слов"
и добавим туда слова, но заметь, из нашего названия библиотеки говорится, что там будут только существительные. Потом после добавления,
мы можем выбрать секцию "Практика слов с написанием", нажав, мы перейдем на отдельную страницу, где наши ранее добавленные слова, будут показываться,
а дальше внизу будет инпут для заполнения перевода и т.д.

Коротко: **Библиотека** в этом случае, выступает как сущность объединения подсущностей, чтобы навигация была понятнее.
Ну если ты еще в танке, то представь, что это как "Категории" для постов, хотя тут, наверное, нужно заметить что "Категории" имеют в себе
много сущностей (посты), а в нашем случае может быть только: категория - один пост. Ну не суть

---

### Карточки слов

"Карточки слов" - это возможность изучение слов через карточки. Эти _карточки_ добавляются в _библиотеку_.

Как пример: _библиотека_ "Животные", в нем будут храниться все слова, которые принадлежат к животным, ну если ты их добавил конечно же.

Есть разные действия над карточками:
- Добавление новых карточек (слов)
- Удаление карточек (слова)
- Редактирование карточек (слова)
- Практика слов (поговорим об этом позже)

**Добавление новых карточек**

Как ты понял, карточка - это слово, а слово - это карточка), это просто синонимы, не заостряй внимание.

В нашей отдельной библиотеке, мы можем добавлять новые _карточки_. Есть страница добавления и она будет состоять из:
- Слово на английском
- Перевод на русском
- Описание (или Контекст) для слова (Рассмотрим более подробно ниже)
- Примеры употрбления слов (не реализовано)


**Что пишем в описание?**

**В описание (или контекст)** - мы пишем то, как мы должны употребить это слово.

Такое встречается во всех языках, что одно слово которое бы подходило под определенную ситуацию по переводу, и если мы его употребляем, то это будет ошибкой.

Допустим: есть слово `kill - убить` - это слово подходит, когда мы хотим сказать что собираемся кого-то убить.

Пример: **я убью тебя (i will kill you)**.

Это слово подходит тут, но если мы употребим это слово в вот таком предложений: **я убиваю время (i am killing time)**, то это не будет правильно.
Слово **kill** обозначает что мы у кого-то или чего-то ЖИВОГО отнимаем жизнь, но употребить для НЕЖИВОГО т.е в нашем случае времени будет неправильно

(Пример выдуман из параллельной вселенной, автор не хотел никого обидеть, и не нёс скрытого значения).

Теперь вернемся и посмотрим как у нас будет добавления слова в _библиотеку_.

Пример добавления:
```
Слово: assume
Перевод: предпологать
Описание: Это слово используется когда мы хотим сказать что мы что-то "предполагаем" и т.д....
Примеры: Пусто (не реализовано)

```

**Удаление карточки слов**

Также присутсвуется возможность удаление добавленных карточек (слов) в _библиотеку_.

**Редактирование слов**

Также есть возможность редактирования добавленных карточек (слов) в _библиотеке_

---
### Изучение слов по карточкам

После того как мы добавили наши карточки (слова), у нас есть возможность изучения их.

Этап изучения происходит довольно просто. Открывается страница и на нем показываются все слова из библиотеки.

Допустим у нас в библиотеке есть 34 слов, и все эти слова будут показываться на этой странице, в виде карточек.

Это будет выглядить вот так:

<img src="./media/Card.png">

Вот так у нас будут выглядет карточки на сайте, листая, мы можем изучать разные слова. Все довольно просто

---

### Практика карточек с написанием

**Практика карточек (слов) с написанием** - это практика карточек (слов), уже непосредственно после изучения слов.

**Чем отличается изучение слов по карточкам и практика карточек с написанием?**

Тем, что в первом случаем, мы изучаем не знакомые нам слова, просто листая их и смотря на перевод.
Вот в нашем случае, мы уже **изученные слова** _практикуем_ в письме.

Думаю, вы сразу поймете, когда увидете пример:

<img src="./media/Practice%20Card.png">

После вот таких ответов на эти слова, нажимаем "Отправить" и нам показывается статистика по этому _тесту_:
сколько правильных и неправильных слов.

В будущем будет возможность просмотра статистек отдельно.

---

### Практика предложении

Практика предложении - это отдельная сущность в библиотеке, куда мы можем добавлять любые предложения и потом практиковаться по ним.

Заметь, этот блок не связан с _карточками слов_, с _практикой карточек слов_.
Это отдельный блок для практики, сюда добавляем любое количество предложений и можем по ним практиковаться.

Пример:

<img src="./media/Practice%20sentences.png">




> Если у тебя есть вопросы, спрашивай. C вами был Ватару Ватанаби, до скорого.
